# FamilyStructMaterialType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyStructMaterialType Property
ParameterTypeId Class See Also
---
"Material for Model Behavior"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyStructMaterialType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyStructMaterialType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyStructMaterialType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace